# Базовый синтаксис
# "вопрос" (id) -> "ответ"
# >>КОМАНДА аргумент1 аргумент2
#
#Регистрирует слушатель сообщений, и выполняет скрипт
"Просьба 1" (1) ->
	БЛОК ДЛЯ
	ОТВЕТА
"Просьба с ??? словом или словосочетанием" (2) ->
	#перейти в блок для ответа ,,Просьба 1,,
	>>JUMP 1
(3) ->
	БЛОК НА КОТОРЫЙ МОЖНО
    ТОЛЬКО ПРЫГНУТЬ
	#Включает слушатель сообщения, для конкретного пользователя
	#После активации выключается, может быть повторно активирован
	"Уточнение 1" ->
		СООБЩЕНИЕ 2
&"Набор слов" (4) ->
	>>IF USER.&TEST == NULL ->
		>>WHEN ->
			>>USER.&TEST = "[TEXT]" #Устанавливает значение переменной
			ЗНАЧЕНИЕ УСТАНОВЛЕНО
			#Переходит к указанному скрипту, и продолжает выполнение
			>>JUMP 3
			СООБЩЕНИЕ КОТОРОЕ НЕ ОТПРАВИТСЯ
			#Не отправится из-за break, который завершает выполнение скрипта
		>>ELSE ->
			#Почти как jump, однако он не прерывает выполнение всего скрипта
			>>RUN 3
			ВИДИМОЕ ПОСТ СООБЩЕНИЕ %USER.&TEST%
		(3) -> 
			#Скрипты имеют свою ,,зону видимости,, а так-же можно переопределить родительский
			#скрипт в дочернем блоке. Вызвать из родительского скрипта дочерний блок не получится
		    ДРУГОЙ БЛОК				 #Так же работают общие локальные переменные скрипта
		    НА КОТОРЫЙ МОЖНО
		    ТОЛЬКО ПРЫГНУТЬ
		    >>BREAK
